import clsx from 'clsx';
import React from 'react';

import 'swiper/css';
import 'swiper/css/navigation';

import s from './BookDescription.module.scss';
import Link from 'next/link';

type Props = {};

const BoookDescription = (props: Props) => {
  return (
    <section className={clsx(s.section, 'section')}>
      <div className="container">
        <div className={s.wrapper}>
          <div className={s.text}>
            <h2 className={s.title}>Опис книги</h2>
            <p>
              Вітання. Добро пожалувати в систему перекладів «UA Translate». Цей сайт призначений
              для професійних мов любительських перекладів будь-яких новелів, фанфіків, ранобе з
              різних мов. Ваші улюблені ранобе, новели та інше на українській мові!
            </p>
            <p>
              До ваших послуг: коментування перекладів та їх фрагментів, різноманітна статистика.
              Також ви можете оцінювати як саму роботу, так і якість перекладу. При бажанні ви
              можете купити у перекладача/автора розділи за які встановлення ціна, тим самим
              допомагаючи та мотивуючи автора/перекладача.
            </p>
            <p>
              Після реєстрації, подаєте заявку на схвалення перекладу (Кнопка: Створити переклад).
              Після схвалення модератором публікуєте розділи перекладу, зробленого вами з іншої
              мови.
            </p>
            <p>
              Перекладач створює переклад, публікує, та встановлює розділи або публічного доступу,
              або платними, доступними за підпискою, які можуть придбати нетерплячі користувачі!
              Перекладач може сам встановити ціну на кожен проект (або взагалі виставити
              безкоштовно), що перекладається. Це гарна мотивація для перекладача, а також швидкий
              переклад для читачів! Звичайно платно робити не обов’язково, це все на ваш вибір!
            </p>
          </div>
        </div>
      </div>
    </section>
  );
};

export default BoookDescription;
